
public class Exa05_문제 {

	public static void main(String[] args) {

		// 1. 주민등록번호를 숫자로 저장하고자 한다. regNo라는 변수를 선언하고
		// 자신의 주민등록번호로 초기화 하도록 한 줄의 코드를 작성하세요.

		// long regNo = 1234567890123L;

		// 2. 다음 문장에서 리터럴(상수), 변수, 키워드를 적으세요.

		// int i=100; 상수는 100, 100L 변수는 i, L 키워드는 int, long
//		long L=100L;
//		System.out.println("1" + "2");//문자열 1과 2사이에 +는 연산이 아니라 연결이므로 12
//		System.out.println('A' + 'B');//문자 A와 B의 코드값은 65와 66, 65+66=131
//		System.out.println('1'+ 2 );//문자 1의 코드값은 49, 하지만 뒤의 2는 int이기때문에 정수+정수가 되어서 단순 연산이 진행된다. , 49+2=51 
//		System.out.println('1' + '2');//문자 2의 코드값은 50, 코드값으로 나왔을시 정수+정수로 되어 연산이 진행된다.  49+50=99
//		System.out.println('J' + "ava");
//		앞은 문자 J여서 코드값을 작성해야 하지만 뒤의 ava가 ""안에 있어 문자열이므로 문자열로 처리를 해야한다.
//		그냥 Java가 나온다.
//		1=49 2=50		
//		12, 131, 51, 99, Java  

		System.out.println("오늘은 \'7월 29일\' , \"목요일\" 입니다.\\a");
	}

}
